[
    {
    "id": "Yannic Ristau",
    "text": "Regardless of how complex or difficult a problem is, Sagar is always willing to solve it. He works hard and consistently to ensure that every challenge is met, and that the customer is completely satisfied with the outcome. His dedication to finding solutions and his commitment to delivering exceptional results are truly impressive. I am constantly impressed by his ability to break down complex problems into manageable parts, and to develop creative solutions that meet the needs of our customers. His passion for engineering and his commitment to excellence are evident in everything he does. ",
    "name": "Yannic Ristau",
    "position": "System Engineer",
    "company": "Trioptics GmbH."
  },
  {
    "id": "Lovekesh Bhatia",
    "text": "One of the qualities in Sagar I appreciate the most is his ability to truly listen and understand a problem before jumping to a solution. He does not just guess or go with assumptions, he takes the time to get to the root of the issue and then finds a clear, accurate, and practical solution. This approach has had a real impact on productivity. What sets him apart is this thoughtfulness and precision in problem-solving. A great example is the Excel tool he created for cross-checking reports, it's still one of the most useful tools the team relies on today.",
    "name": "Lovekesh Bhatia",
    "position": "Head of QA/QC (Optics)",
    "company": "Paras Space and Defence Technologies Pvt. Ltd."
  },
  {
    "id": "Prashant Misal",
    "text": "Sagar has always shown real sincerity in whatever task he's given. One thing that stands out is how he makes sure to give accurate updates before the end of the day, it helps keep everything running smoothly. He doesn't just stop at completing the work either,  he takes the time to analyze it and often suggests ways it could be improved in the future. He's genuinely curious, picks things up quickly, and listens really well. His attitude toward work is always positive, and he has this habit of thinking two steps ahead when it comes to execution. It's that kind of mindset that makes a big difference on any team.",
    "name": "Prashant Misal",
    "position": "Assitant Manager",
    "company": "Hindustan Petroleum Corporation Limited"
  }
]
